tap "homebrew/bundle"
# Microsoft Azure CLI 2.0
# brew "azure-cli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Tool Command Language
brew "tcl-tk"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Convert HTML to PDF or PostScript
brew "htmldoc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Java-based project management
brew "maven"
# Run a Kubernetes cluster locally
# brew "minikube"
# HTTP/2 C Library
brew "nghttp2"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Internet file retriever
brew "wget"
# Tracks most-used directories to make cd smarter
brew "z"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Prevents your sleeping computer from connecting to Bluetooth accessories
cask "bluesnooze"
# Free and open-source web browser
cask "chromium"
# Clipboard manager with advanced features
cask "copyq"
# Universal database tool and SQL client
cask "dbeaver-community"
# Kubernetes IDE
# cask "lens"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Visual tool to design, develop and administer MySQL servers
# cask "mysqlworkbench"
# Collaboration platform for API development
cask "postman"
# Instant messaging application focusing on security
# cask "signal"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
vscode "adpyke.vscode-sql-formatter"
vscode "DotJoshJohnson.xml"
vscode "george-alisson.html-preview-vscode"
vscode "GrapeCity.gc-excelviewer"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "redhat.java"
vscode "streetsidesoftware.code-spell-checker"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
