tap "hashicorp/tap"
tap "homebrew/bundle"
tap "localstack/tap"
tap "oven-sh/bun"
tap "thegreenwebfoundation/carbon-aware-tools"
brew "bash"
brew "bash-completion@2"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "coreutils"
brew "openssl@3"
brew "libssh2"
brew "curl"
brew "jpeg-turbo"
brew "openjpeg"
brew "ghostscript"
brew "git"
brew "tcl-tk"
brew "git-gui"
brew "gradle"
brew "htmldoc"
brew "icu4c@76"
brew "jq"
brew "libidn2"
brew "maven"
brew "minikube"
brew "nghttp2"
brew "nvm"
brew "openjdk@17"
brew "openssl@1.1"
brew "ripgrep"
brew "tree"
brew "wget"
brew "z"
brew "oven-sh/bun/bun"
brew "thegreenwebfoundation/carbon-aware-tools/grid-intensity"
cask "amethyst"
cask "avidemux"
cask "bluesnooze"
cask "chromium"
cask "copyq"
cask "dbeaver-community"
cask "docker-desktop"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "libreoffice"
cask "mattermost"
cask "netnewswire"
cask "obsidian"
cask "pomatez"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
vscode "adpyke.vscode-sql-formatter"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "fosshaas.fontsize-shortcuts"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tyriar.sort-lines"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
